zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXW/periph5/PERI_XCVR_TSM.h
#define XCVR_TSM_TIMING50_SEQ_CBPF_EN_DCOC_RX_LO_MASK (0xFF000000U)
#define XCVR_TSM_TIMING50_SEQ_CBPF_EN_DCOC_RX_LO_SHIFT (24U)
/*! SEQ_CBPF_EN_DCOC_RX_LO - De-assertion time setting for SEQ_CBPF_EN_DCOC (RX) */
#define XCVR_TSM_TIMING50_SEQ_CBPF_EN_DCOC_RX_LO(x) (((uint32_t)(((uint32_t)(x)) << XCVR_TSM_TIMING50_SEQ_CBPF_EN_DCOC_RX_LO_SHIFT)) & XCVR_TSM_TIMING50_SEQ_CBPF_EN_DCOC_RX_LO_MASK)
/*! @} */

/*! @name TIMING51 - TSM_TIMING51 */
/*! @{ */

#define XCVR_TSM_TIMING51_SEQ_RX_GANG_PUP_TX_HI_MASK (0xFFU)
#define XCVR_TSM_TIMING51_SEQ_RX_GANG_PUP_TX_HI_SHIFT (0U)
/*! SEQ_RX_GANG_PUP_TX_HI - Assertion time setting for SEQ_(RX_LAN/RX_MIX/CBPF/ADC_PUP) and SEQ_SPARE1 (TX) */
#define XCVR_TSM_TIMING51_SEQ_RX_GANG_PUP_TX_HI(x) (((uint32_t)(((uint32_t)(x)) << XCVR_TSM_TIMING51_SEQ_RX_GANG_PUP_TX_HI_SHIFT)) & XCVR_TSM_TIMING51_SEQ_RX_GANG_PUP_TX_HI_MASK)

#define XCVR_TSM_TIMING51_SEQ_RX_GANG_PUP_TX_LO_MASK (0xFF00U)
#define XCVR_TSM_TIMING51_SEQ_RX_GANG_PUP_TX_LO_SHIFT (8U)
/*! SEQ_RX_GANG_PUP_TX_LO - De-assertion time setting for SEQ_(RX_LAN/RX_MIX/CBPF/ADC_PUP) and SEQ_SPARE1 (TX) */
#define XCVR_TSM_TIMING51_SEQ_RX_GANG_PUP_TX_LO(x) (((uint32_t)(((uint32_t)(x)) << XCVR_TSM_TIMING51_SEQ_RX_GANG_PUP_TX_LO_SHIFT)) & XCVR_TSM_TIMING51_SEQ_RX_GANG_PUP_TX_LO_MASK)

#define XCVR_TSM_TIMING51_SEQ_RX_GANG_PUP_RX_HI_MASK (0xFF0000U)
#define XCVR_TSM_TIMING51_SEQ_RX_GANG_PUP_RX_HI_SHIFT (16U)
/*! SEQ_RX_GANG_PUP_RX_HI - Assertion time setting for SEQ_(RX_LAN/RX_MIX/CBPF/ADC_PUP) and SEQ_SPARE1 (RX) */
#define XCVR_TSM_TIMING51_SEQ_RX_GANG_PUP_RX_HI(x) (((uint32_t)(((uint32_t)(x)) << XCVR_TSM_TIMING51_SEQ_RX_GANG_PUP_RX_HI_SHIFT)) & XCVR_TSM_TIMING51_SEQ_RX_GANG_PUP_RX_HI_MASK)

#define XCVR_TSM_TIMING51_SEQ_RX_GANG_PUP_RX_LO_MASK (0xFF000000U)
#define XCVR_TSM_TIMING51_SEQ_RX_GANG_PUP_RX_LO_SHIFT (24U)
/*! SEQ_RX_GANG_PUP_RX_LO - De-assertion time setting for SEQ_(RX_LAN/RX_MIX/CBPF/ADC_PUP) and SEQ_SPARE1 (RX) */
#define XCVR_TSM_TIMING51_SEQ_RX_GANG_PUP_RX_LO(x) (((uint32_t)(((uint32_t)(x)) << XCVR_TSM_TIMING51_SEQ_RX_GANG_PUP_RX_LO_SHIFT)) & XCVR_TSM_TIMING51_SEQ_RX_GANG_PUP_RX_LO_MASK)
/*! @} */

/*! @name TIMING52 - TSM_TIMING52 */
/*! @{ */

#define XCVR_TSM_TIMING52_SEQ_SPARE3_TX_HI_MASK  (0xFFU)
#define XCVR_TSM_TIMING52_SEQ_SPARE3_TX_HI_SHIFT (0U)
/*! SEQ_SPARE3_TX_HI - Assertion time setting for SEQ_SPARE3 (TX) */
#define XCVR_TSM_TIMING52_SEQ_SPARE3_TX_HI(x)    (((uint32_t)(((uint32_t)(x)) << XCVR_TSM_TIMING52_SEQ_SPARE3_TX_HI_SHIFT)) & XCVR_TSM_TIMING52_SEQ_SPARE3_TX_HI_MASK)

#define XCVR_TSM_TIMING52_SEQ_SPARE3_TX_LO_MASK  (0xFF00U)
#define XCVR_TSM_TIMING52_SEQ_SPARE3_TX_LO_SHIFT (8U)
/*! SEQ_SPARE3_TX_LO - De-assertion time setting for SEQ_SPARE3 (TX) */
#define XCVR_TSM_TIMING52_SEQ_SPARE3_TX_LO(x)    (((uint32_t)(((uint32_t)(x)) << XCVR_TSM_TIMING52_SEQ_SPARE3_TX_LO_SHIFT)) & XCVR_TSM_TIMING52_SEQ_SPARE3_TX_LO_MASK)

#define XCVR_TSM_TIMING52_SEQ_SPARE3_RX_HI_MASK  (0xFF0000U)
#define XCVR_TSM_TIMING52_SEQ_SPARE3_RX_HI_SHIFT (16U)
/*! SEQ_SPARE3_RX_HI - Assertion time setting for SEQ_SPARE3 (RX) */
#define XCVR_TSM_TIMING52_SEQ_SPARE3_RX_HI(x)    (((uint32_t)(((uint32_t)(x)) << XCVR_TSM_TIMING52_SEQ_SPARE3_RX_HI_SHIFT)) & XCVR_TSM_TIMING52_SEQ_SPARE3_RX_HI_MASK)

#define XCVR_TSM_TIMING52_SEQ_SPARE3_RX_LO_MASK  (0xFF000000U)
#define XCVR_TSM_TIMING52_SEQ_SPARE3_RX_LO_SHIFT (24U)
/*! SEQ_SPARE3_RX_LO - De-assertion time setting for SEQ_SPARE3 (RX) */
#define XCVR_TSM_TIMING52_SEQ_SPARE3_RX_LO(x)    (((uint32_t)(((uint32_t)(x)) << XCVR_TSM_TIMING52_SEQ_SPARE3_RX_LO_SHIFT)) & XCVR_TSM_TIMING52_SEQ_SPARE3_RX_LO_MASK)
/*! @} */

/*! @name TIMING53 - TSM TIMING_53 */
/*! @{ */

#define XCVR_TSM_TIMING53_GEAR_SHIFT_TX_HI_MASK  (0xFFU)
#define XCVR_TSM_TIMING53_GEAR_SHIFT_TX_HI_SHIFT (0U)
/*! GEAR_SHIFT_TX_HI - Assertion time setting for GEAR_SHIFT (TX) */
#define XCVR_TSM_TIMING53_GEAR_SHIFT_TX_HI(x)    (((uint32_t)(((uint32_t)(x)) << XCVR_TSM_TIMING53_GEAR_SHIFT_TX_HI_SHIFT)) & XCVR_TSM_TIMING53_GEAR_SHIFT_TX_HI_MASK)

#define XCVR_TSM_TIMING53_GEAR_SHIFT_TX_LO_MASK  (0xFF00U)
#define XCVR_TSM_TIMING53_GEAR_SHIFT_TX_LO_SHIFT (8U)
/*! GEAR_SHIFT_TX_LO - De-assertion time setting for GEAR_SHIFT (TX) */
#define XCVR_TSM_TIMING53_GEAR_SHIFT_TX_LO(x)    (((uint32_t)(((uint32_t)(x)) << XCVR_TSM_TIMING53_GEAR_SHIFT_TX_LO_SHIFT)) & XCVR_TSM_TIMING53_GEAR_SHIFT_TX_LO_MASK)

#define XCVR_TSM_TIMING53_GEAR_SHIFT_RX_HI_MASK  (0xFF0000U)
#define XCVR_TSM_TIMING53_GEAR_SHIFT_RX_HI_SHIFT (16U)
/*! GEAR_SHIFT_RX_HI - Assertion time setting for GEAR_SHIFT (RX) */
#define XCVR_TSM_TIMING53_GEAR_SHIFT_RX_HI(x)    (((uint32_t)(((uint32_t)(x)) << XCVR_TSM_TIMING53_GEAR_SHIFT_RX_HI_SHIFT)) & XCVR_TSM_TIMING53_GEAR_SHIFT_RX_HI_MASK)

#define XCVR_TSM_TIMING53_GEAR_SHIFT_RX_LO_MASK  (0xFF000000U)
#define XCVR_TSM_TIMING53_GEAR_SHIFT_RX_LO_SHIFT (24U)
/*! GEAR_SHIFT_RX_LO - De-assertion time setting for GEAR_SHIFT (RX) */
#define XCVR_TSM_TIMING53_GEAR_SHIFT_RX_LO(x)    (((uint32_t)(((uint32_t)(x)) << XCVR_TSM_TIMING53_GEAR_SHIFT_RX_LO_SHIFT)) & XCVR_TSM_TIMING53_GEAR_SHIFT_RX_LO_MASK)
/*! @} */

/*! @name TIMING54 - TSM TIMING_54 */
/*! @{ */

#define XCVR_TSM_TIMING54_SEQ_PIC_CORE_EN_TX_HI_MASK (0xFFU)
#define XCVR_TSM_TIMING54_SEQ_PIC_CORE_EN_TX_HI_SHIFT (0U)
/*! SEQ_PIC_CORE_EN_TX_HI - Assertion time setting for SEQ_PIC_CORE_EN (TX) */
#define XCVR_TSM_TIMING54_SEQ_PIC_CORE_EN_TX_HI(x) (((uint32_t)(((uint32_t)(x)) << XCVR_TSM_TIMING54_SEQ_PIC_CORE_EN_TX_HI_SHIFT)) & XCVR_TSM_TIMING54_SEQ_PIC_CORE_EN_TX_HI_MASK)

#define XCVR_TSM_TIMING54_SEQ_PIC_CORE_EN_TX_LO_MASK (0xFF00U)
#define XCVR_TSM_TIMING54_SEQ_PIC_CORE_EN_TX_LO_SHIFT (8U)
/*! SEQ_PIC_CORE_EN_TX_LO - De-assertion time setting for SEQ_PIC_CORE_EN (TX) */
#define XCVR_TSM_TIMING54_SEQ_PIC_CORE_EN_TX_LO(x) (((uint32_t)(((uint32_t)(x)) << XCVR_TSM_TIMING54_SEQ_PIC_CORE_EN_TX_LO_SHIFT)) & XCVR_TSM_TIMING54_SEQ_PIC_CORE_EN_TX_LO_MASK)

#define XCVR_TSM_TIMING54_SEQ_PIC_CORE_EN_RX_HI_MASK (0xFF0000U)
#define XCVR_TSM_TIMING54_SEQ_PIC_CORE_EN_RX_HI_SHIFT (16U)
/*! SEQ_PIC_CORE_EN_RX_HI - Assertion time setting for SEQ_PIC_CORE_EN (RX) */
#define XCVR_TSM_TIMING54_SEQ_PIC_CORE_EN_RX_HI(x) (((uint32_t)(((uint32_t)(x)) << XCVR_TSM_TIMING54_SEQ_PIC_CORE_EN_RX_HI_SHIFT)) & XCVR_TSM_TIMING54_SEQ_PIC_CORE_EN_RX_HI_MASK)

#define XCVR_TSM_TIMING54_SEQ_PIC_CORE_EN_RX_LO_MASK (0xFF000000U)
#define XCVR_TSM_TIMING54_SEQ_PIC_CORE_EN_RX_LO_SHIFT (24U)
/*! SEQ_PIC_CORE_EN_RX_LO - De-assertion time setting for SEQ_PIC_CORE_EN (RX) */
#define XCVR_TSM_TIMING54_SEQ_PIC_CORE_EN_RX_LO(x) (((uint32_t)(((uint32_t)(x)) << XCVR_TSM_TIMING54_SEQ_PIC_CORE_EN_RX_LO_SHIFT)) & XCVR_TSM_TIMING54_SEQ_PIC_CORE_EN_RX_LO_MASK)
/*! @} */

/*! @name TIMING55 - TSM TIMING_55 */
/*! @{ */

#define XCVR_TSM_TIMING55_SEQ_PIC_SHORT_CINT_SHORT_EN_TX_HI_MASK (0xFFU)
#define XCVR_TSM_TIMING55_SEQ_PIC_SHORT_CINT_SHORT_EN_TX_HI_SHIFT (0U)
/*! SEQ_PIC_SHORT_CINT_SHORT_EN_TX_HI - Assertion time setting for SEQ_PIC_SHORT_CINT_SHORT_EN (TX) */
#define XCVR_TSM_TIMING55_SEQ_PIC_SHORT_CINT_SHORT_EN_TX_HI(x) (((uint32_t)(((uint32_t)(x)) << XCVR_TSM_TIMING55_SEQ_PIC_SHORT_CINT_SHORT_EN_TX_HI_SHIFT)) & XCVR_TSM_TIMING55_SEQ_PIC_SHORT_CINT_SHORT_EN_TX_HI_MASK)

