zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXW/periph5/PERI_XCVR_TSM.h
#define XCVR_TSM_TIMING55_SEQ_PIC_SHORT_CINT_SHORT_EN_TX_LO_MASK (0xFF00U)
#define XCVR_TSM_TIMING55_SEQ_PIC_SHORT_CINT_SHORT_EN_TX_LO_SHIFT (8U)
/*! SEQ_PIC_SHORT_CINT_SHORT_EN_TX_LO - De-assertion time setting for SEQ_PIC_SHORT_CINT_SHORT_EN (TX) */
#define XCVR_TSM_TIMING55_SEQ_PIC_SHORT_CINT_SHORT_EN_TX_LO(x) (((uint32_t)(((uint32_t)(x)) << XCVR_TSM_TIMING55_SEQ_PIC_SHORT_CINT_SHORT_EN_TX_LO_SHIFT)) & XCVR_TSM_TIMING55_SEQ_PIC_SHORT_CINT_SHORT_EN_TX_LO_MASK)

#define XCVR_TSM_TIMING55_SEQ_PIC_SHORT_CINT_SHORT_EN_RX_HI_MASK (0xFF0000U)
#define XCVR_TSM_TIMING55_SEQ_PIC_SHORT_CINT_SHORT_EN_RX_HI_SHIFT (16U)
/*! SEQ_PIC_SHORT_CINT_SHORT_EN_RX_HI - Assertion time setting for SEQ_PIC_SHORT_CINT_SHORT_EN (RX) */
#define XCVR_TSM_TIMING55_SEQ_PIC_SHORT_CINT_SHORT_EN_RX_HI(x) (((uint32_t)(((uint32_t)(x)) << XCVR_TSM_TIMING55_SEQ_PIC_SHORT_CINT_SHORT_EN_RX_HI_SHIFT)) & XCVR_TSM_TIMING55_SEQ_PIC_SHORT_CINT_SHORT_EN_RX_HI_MASK)

#define XCVR_TSM_TIMING55_SEQ_PIC_SHORT_CINT_SHORT_EN_RX_LO_MASK (0xFF000000U)
#define XCVR_TSM_TIMING55_SEQ_PIC_SHORT_CINT_SHORT_EN_RX_LO_SHIFT (24U)
/*! SEQ_PIC_SHORT_CINT_SHORT_EN_RX_LO - De-assertion time setting for SEQ_PIC_SHORT_CINT_SHORT_EN (RX) */
#define XCVR_TSM_TIMING55_SEQ_PIC_SHORT_CINT_SHORT_EN_RX_LO(x) (((uint32_t)(((uint32_t)(x)) << XCVR_TSM_TIMING55_SEQ_PIC_SHORT_CINT_SHORT_EN_RX_LO_SHIFT)) & XCVR_TSM_TIMING55_SEQ_PIC_SHORT_CINT_SHORT_EN_RX_LO_MASK)
/*! @} */

/*! @name TIMING56 - TSM TIMING_56 */
/*! @{ */

#define XCVR_TSM_TIMING56_SEQ_PIC_FILTER_LOW_BW_SM_EN_TX_HI_MASK (0xFFU)
#define XCVR_TSM_TIMING56_SEQ_PIC_FILTER_LOW_BW_SM_EN_TX_HI_SHIFT (0U)
/*! SEQ_PIC_FILTER_LOW_BW_SM_EN_TX_HI - Assertion time setting for SEQ_PIC_FILTER_LOW_BW_SM_EN (TX) */
#define XCVR_TSM_TIMING56_SEQ_PIC_FILTER_LOW_BW_SM_EN_TX_HI(x) (((uint32_t)(((uint32_t)(x)) << XCVR_TSM_TIMING56_SEQ_PIC_FILTER_LOW_BW_SM_EN_TX_HI_SHIFT)) & XCVR_TSM_TIMING56_SEQ_PIC_FILTER_LOW_BW_SM_EN_TX_HI_MASK)

#define XCVR_TSM_TIMING56_SEQ_PIC_FILTER_LOW_BW_SM_EN_TX_LO_MASK (0xFF00U)
#define XCVR_TSM_TIMING56_SEQ_PIC_FILTER_LOW_BW_SM_EN_TX_LO_SHIFT (8U)
/*! SEQ_PIC_FILTER_LOW_BW_SM_EN_TX_LO - De-assertion time setting for SEQ_PIC_FILTER_LOW_BW_SM_EN (TX) */
#define XCVR_TSM_TIMING56_SEQ_PIC_FILTER_LOW_BW_SM_EN_TX_LO(x) (((uint32_t)(((uint32_t)(x)) << XCVR_TSM_TIMING56_SEQ_PIC_FILTER_LOW_BW_SM_EN_TX_LO_SHIFT)) & XCVR_TSM_TIMING56_SEQ_PIC_FILTER_LOW_BW_SM_EN_TX_LO_MASK)

#define XCVR_TSM_TIMING56_SEQ_PIC_FILTER_LOW_BW_SM_EN_RX_HI_MASK (0xFF0000U)
#define XCVR_TSM_TIMING56_SEQ_PIC_FILTER_LOW_BW_SM_EN_RX_HI_SHIFT (16U)
/*! SEQ_PIC_FILTER_LOW_BW_SM_EN_RX_HI - Assertion time setting for SEQ_PIC_FILTER_LOW_BW_SM_EN (RX) */
#define XCVR_TSM_TIMING56_SEQ_PIC_FILTER_LOW_BW_SM_EN_RX_HI(x) (((uint32_t)(((uint32_t)(x)) << XCVR_TSM_TIMING56_SEQ_PIC_FILTER_LOW_BW_SM_EN_RX_HI_SHIFT)) & XCVR_TSM_TIMING56_SEQ_PIC_FILTER_LOW_BW_SM_EN_RX_HI_MASK)

#define XCVR_TSM_TIMING56_SEQ_PIC_FILTER_LOW_BW_SM_EN_RX_LO_MASK (0xFF000000U)
#define XCVR_TSM_TIMING56_SEQ_PIC_FILTER_LOW_BW_SM_EN_RX_LO_SHIFT (24U)
/*! SEQ_PIC_FILTER_LOW_BW_SM_EN_RX_LO - De-assertion time setting for SEQ_PIC_FILTER_LOW_BW_SM_EN (RX) */
#define XCVR_TSM_TIMING56_SEQ_PIC_FILTER_LOW_BW_SM_EN_RX_LO(x) (((uint32_t)(((uint32_t)(x)) << XCVR_TSM_TIMING56_SEQ_PIC_FILTER_LOW_BW_SM_EN_RX_LO_SHIFT)) & XCVR_TSM_TIMING56_SEQ_PIC_FILTER_LOW_BW_SM_EN_RX_LO_MASK)
/*! @} */

/*! @name TIMING57 - TSM TIMING_57 */
/*! @{ */

#define XCVR_TSM_TIMING57_SEQ_PIC_RFB_OPEN_SM_EN_TX_HI_MASK (0xFFU)
#define XCVR_TSM_TIMING57_SEQ_PIC_RFB_OPEN_SM_EN_TX_HI_SHIFT (0U)
/*! SEQ_PIC_RFB_OPEN_SM_EN_TX_HI - Assertion time setting for SEQ_PIC_RFB_OPEN_SM_EN (TX) */
#define XCVR_TSM_TIMING57_SEQ_PIC_RFB_OPEN_SM_EN_TX_HI(x) (((uint32_t)(((uint32_t)(x)) << XCVR_TSM_TIMING57_SEQ_PIC_RFB_OPEN_SM_EN_TX_HI_SHIFT)) & XCVR_TSM_TIMING57_SEQ_PIC_RFB_OPEN_SM_EN_TX_HI_MASK)

#define XCVR_TSM_TIMING57_SEQ_PIC_RFB_OPEN_SM_EN_TX_LO_MASK (0xFF00U)
#define XCVR_TSM_TIMING57_SEQ_PIC_RFB_OPEN_SM_EN_TX_LO_SHIFT (8U)
/*! SEQ_PIC_RFB_OPEN_SM_EN_TX_LO - De-assertion time setting for SEQ_PIC_RFB_OPEN_SM_EN (TX) */
#define XCVR_TSM_TIMING57_SEQ_PIC_RFB_OPEN_SM_EN_TX_LO(x) (((uint32_t)(((uint32_t)(x)) << XCVR_TSM_TIMING57_SEQ_PIC_RFB_OPEN_SM_EN_TX_LO_SHIFT)) & XCVR_TSM_TIMING57_SEQ_PIC_RFB_OPEN_SM_EN_TX_LO_MASK)

#define XCVR_TSM_TIMING57_SEQ_PIC_RFB_OPEN_SM_EN_RX_HI_MASK (0xFF0000U)
#define XCVR_TSM_TIMING57_SEQ_PIC_RFB_OPEN_SM_EN_RX_HI_SHIFT (16U)
/*! SEQ_PIC_RFB_OPEN_SM_EN_RX_HI - Assertion time setting for SEQ_PIC_RFB_OPEN_SM_EN (RX) */
#define XCVR_TSM_TIMING57_SEQ_PIC_RFB_OPEN_SM_EN_RX_HI(x) (((uint32_t)(((uint32_t)(x)) << XCVR_TSM_TIMING57_SEQ_PIC_RFB_OPEN_SM_EN_RX_HI_SHIFT)) & XCVR_TSM_TIMING57_SEQ_PIC_RFB_OPEN_SM_EN_RX_HI_MASK)

#define XCVR_TSM_TIMING57_SEQ_PIC_RFB_OPEN_SM_EN_RX_LO_MASK (0xFF000000U)
#define XCVR_TSM_TIMING57_SEQ_PIC_RFB_OPEN_SM_EN_RX_LO_SHIFT (24U)
/*! SEQ_PIC_RFB_OPEN_SM_EN_RX_LO - De-assertion time setting for SEQ_PIC_RFB_OPEN_SM_EN (RX) */
#define XCVR_TSM_TIMING57_SEQ_PIC_RFB_OPEN_SM_EN_RX_LO(x) (((uint32_t)(((uint32_t)(x)) << XCVR_TSM_TIMING57_SEQ_PIC_RFB_OPEN_SM_EN_RX_LO_SHIFT)) & XCVR_TSM_TIMING57_SEQ_PIC_RFB_OPEN_SM_EN_RX_LO_MASK)
/*! @} */

/*! @name TIMING58 - TSM TIMING_58 */
/*! @{ */

#define XCVR_TSM_TIMING58_SEQ_PIC_RINT2_SHORT_FM_EN_TX_HI_MASK (0xFFU)
#define XCVR_TSM_TIMING58_SEQ_PIC_RINT2_SHORT_FM_EN_TX_HI_SHIFT (0U)
/*! SEQ_PIC_RINT2_SHORT_FM_EN_TX_HI - Assertion time setting for SEQ_PIC_RINT2_SHORT_FM_EN (TX) */
#define XCVR_TSM_TIMING58_SEQ_PIC_RINT2_SHORT_FM_EN_TX_HI(x) (((uint32_t)(((uint32_t)(x)) << XCVR_TSM_TIMING58_SEQ_PIC_RINT2_SHORT_FM_EN_TX_HI_SHIFT)) & XCVR_TSM_TIMING58_SEQ_PIC_RINT2_SHORT_FM_EN_TX_HI_MASK)

#define XCVR_TSM_TIMING58_SEQ_PIC_RINT2_SHORT_FM_EN_TX_LO_MASK (0xFF00U)
#define XCVR_TSM_TIMING58_SEQ_PIC_RINT2_SHORT_FM_EN_TX_LO_SHIFT (8U)
/*! SEQ_PIC_RINT2_SHORT_FM_EN_TX_LO - De-assertion time setting for SEQ_PIC_RINT2_SHORT_FM_EN (TX) */
#define XCVR_TSM_TIMING58_SEQ_PIC_RINT2_SHORT_FM_EN_TX_LO(x) (((uint32_t)(((uint32_t)(x)) << XCVR_TSM_TIMING58_SEQ_PIC_RINT2_SHORT_FM_EN_TX_LO_SHIFT)) & XCVR_TSM_TIMING58_SEQ_PIC_RINT2_SHORT_FM_EN_TX_LO_MASK)

#define XCVR_TSM_TIMING58_SEQ_PIC_RINT2_SHORT_FM_EN_RX_HI_MASK (0xFF0000U)
#define XCVR_TSM_TIMING58_SEQ_PIC_RINT2_SHORT_FM_EN_RX_HI_SHIFT (16U)
/*! SEQ_PIC_RINT2_SHORT_FM_EN_RX_HI - Assertion time setting for SEQ_PIC_RINT2_SHORT_FM_EN (RX) */
#define XCVR_TSM_TIMING58_SEQ_PIC_RINT2_SHORT_FM_EN_RX_HI(x) (((uint32_t)(((uint32_t)(x)) << XCVR_TSM_TIMING58_SEQ_PIC_RINT2_SHORT_FM_EN_RX_HI_SHIFT)) & XCVR_TSM_TIMING58_SEQ_PIC_RINT2_SHORT_FM_EN_RX_HI_MASK)

