zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXW/periph5/PERI_XCVR_TSM.h
#define XCVR_TSM_TIMING58_SEQ_PIC_RINT2_SHORT_FM_EN_RX_LO_MASK (0xFF000000U)
#define XCVR_TSM_TIMING58_SEQ_PIC_RINT2_SHORT_FM_EN_RX_LO_SHIFT (24U)
/*! SEQ_PIC_RINT2_SHORT_FM_EN_RX_LO - De-assertion time setting for SEQ_PIC_RINT2_SHORT_FM_EN (RX) */
#define XCVR_TSM_TIMING58_SEQ_PIC_RINT2_SHORT_FM_EN_RX_LO(x) (((uint32_t)(((uint32_t)(x)) << XCVR_TSM_TIMING58_SEQ_PIC_RINT2_SHORT_FM_EN_RX_LO_SHIFT)) & XCVR_TSM_TIMING58_SEQ_PIC_RINT2_SHORT_FM_EN_RX_LO_MASK)
/*! @} */

/*! @name TIMING59 - TSM TIMING_59 */
/*! @{ */

#define XCVR_TSM_TIMING59_SEQ_LODIV_SYNC_RESET_EN_TX_HI_MASK (0xFFU)
#define XCVR_TSM_TIMING59_SEQ_LODIV_SYNC_RESET_EN_TX_HI_SHIFT (0U)
/*! SEQ_LODIV_SYNC_RESET_EN_TX_HI - Assertion time setting for SEQ_LODIV_SYNC_RESET_EN (TX) */
#define XCVR_TSM_TIMING59_SEQ_LODIV_SYNC_RESET_EN_TX_HI(x) (((uint32_t)(((uint32_t)(x)) << XCVR_TSM_TIMING59_SEQ_LODIV_SYNC_RESET_EN_TX_HI_SHIFT)) & XCVR_TSM_TIMING59_SEQ_LODIV_SYNC_RESET_EN_TX_HI_MASK)

#define XCVR_TSM_TIMING59_SEQ_LODIV_SYNC_RESET_EN_TX_LO_MASK (0xFF00U)
#define XCVR_TSM_TIMING59_SEQ_LODIV_SYNC_RESET_EN_TX_LO_SHIFT (8U)
/*! SEQ_LODIV_SYNC_RESET_EN_TX_LO - De-assertion time setting for SEQ_LODIV_SYNC_RESET_EN (TX) */
#define XCVR_TSM_TIMING59_SEQ_LODIV_SYNC_RESET_EN_TX_LO(x) (((uint32_t)(((uint32_t)(x)) << XCVR_TSM_TIMING59_SEQ_LODIV_SYNC_RESET_EN_TX_LO_SHIFT)) & XCVR_TSM_TIMING59_SEQ_LODIV_SYNC_RESET_EN_TX_LO_MASK)

#define XCVR_TSM_TIMING59_SEQ_LODIV_SYNC_RESET_EN_RX_HI_MASK (0xFF0000U)
#define XCVR_TSM_TIMING59_SEQ_LODIV_SYNC_RESET_EN_RX_HI_SHIFT (16U)
/*! SEQ_LODIV_SYNC_RESET_EN_RX_HI - Assertion time setting for SEQ_LODIV_SYNC_RESET_EN (RX) */
#define XCVR_TSM_TIMING59_SEQ_LODIV_SYNC_RESET_EN_RX_HI(x) (((uint32_t)(((uint32_t)(x)) << XCVR_TSM_TIMING59_SEQ_LODIV_SYNC_RESET_EN_RX_HI_SHIFT)) & XCVR_TSM_TIMING59_SEQ_LODIV_SYNC_RESET_EN_RX_HI_MASK)

#define XCVR_TSM_TIMING59_SEQ_LODIV_SYNC_RESET_EN_RX_LO_MASK (0xFF000000U)
#define XCVR_TSM_TIMING59_SEQ_LODIV_SYNC_RESET_EN_RX_LO_SHIFT (24U)
/*! SEQ_LODIV_SYNC_RESET_EN_RX_LO - De-assertion time setting for SEQ_LODIV_SYNC_RESET_EN (RX) */
#define XCVR_TSM_TIMING59_SEQ_LODIV_SYNC_RESET_EN_RX_LO(x) (((uint32_t)(((uint32_t)(x)) << XCVR_TSM_TIMING59_SEQ_LODIV_SYNC_RESET_EN_RX_LO_SHIFT)) & XCVR_TSM_TIMING59_SEQ_LODIV_SYNC_RESET_EN_RX_LO_MASK)
/*! @} */

/*! @name TIMING60 - TSM TIMING_60 */
/*! @{ */

#define XCVR_TSM_TIMING60_SEQ_LODIV_SYNC_EN_TX_HI_MASK (0xFFU)
#define XCVR_TSM_TIMING60_SEQ_LODIV_SYNC_EN_TX_HI_SHIFT (0U)
/*! SEQ_LODIV_SYNC_EN_TX_HI - Assertion time setting for SEQ_LODIV_SYNC_EN (TX) */
#define XCVR_TSM_TIMING60_SEQ_LODIV_SYNC_EN_TX_HI(x) (((uint32_t)(((uint32_t)(x)) << XCVR_TSM_TIMING60_SEQ_LODIV_SYNC_EN_TX_HI_SHIFT)) & XCVR_TSM_TIMING60_SEQ_LODIV_SYNC_EN_TX_HI_MASK)

#define XCVR_TSM_TIMING60_SEQ_LODIV_SYNC_EN_TX_LO_MASK (0xFF00U)
#define XCVR_TSM_TIMING60_SEQ_LODIV_SYNC_EN_TX_LO_SHIFT (8U)
/*! SEQ_LODIV_SYNC_EN_TX_LO - De-assertion time setting for SEQ_LODIV_SYNC_EN (TX) */
#define XCVR_TSM_TIMING60_SEQ_LODIV_SYNC_EN_TX_LO(x) (((uint32_t)(((uint32_t)(x)) << XCVR_TSM_TIMING60_SEQ_LODIV_SYNC_EN_TX_LO_SHIFT)) & XCVR_TSM_TIMING60_SEQ_LODIV_SYNC_EN_TX_LO_MASK)

#define XCVR_TSM_TIMING60_SEQ_LODIV_SYNC_EN_RX_HI_MASK (0xFF0000U)
#define XCVR_TSM_TIMING60_SEQ_LODIV_SYNC_EN_RX_HI_SHIFT (16U)
/*! SEQ_LODIV_SYNC_EN_RX_HI - Assertion time setting for SEQ_LODIV_SYNC_EN (RX) */
#define XCVR_TSM_TIMING60_SEQ_LODIV_SYNC_EN_RX_HI(x) (((uint32_t)(((uint32_t)(x)) << XCVR_TSM_TIMING60_SEQ_LODIV_SYNC_EN_RX_HI_SHIFT)) & XCVR_TSM_TIMING60_SEQ_LODIV_SYNC_EN_RX_HI_MASK)

#define XCVR_TSM_TIMING60_SEQ_LODIV_SYNC_EN_RX_LO_MASK (0xFF000000U)
#define XCVR_TSM_TIMING60_SEQ_LODIV_SYNC_EN_RX_LO_SHIFT (24U)
/*! SEQ_LODIV_SYNC_EN_RX_LO - De-assertion time setting for SEQ_LODIV_SYNC_EN (RX) */
#define XCVR_TSM_TIMING60_SEQ_LODIV_SYNC_EN_RX_LO(x) (((uint32_t)(((uint32_t)(x)) << XCVR_TSM_TIMING60_SEQ_LODIV_SYNC_EN_RX_LO_SHIFT)) & XCVR_TSM_TIMING60_SEQ_LODIV_SYNC_EN_RX_LO_MASK)
/*! @} */

/*! @name TIMING61 - TSM TIMING_61 */
/*! @{ */

#define XCVR_TSM_TIMING61_SEQ_LODIV_SYNC_SPARE_EN_TX_HI_MASK (0xFFU)
#define XCVR_TSM_TIMING61_SEQ_LODIV_SYNC_SPARE_EN_TX_HI_SHIFT (0U)
/*! SEQ_LODIV_SYNC_SPARE_EN_TX_HI - Assertion time setting for SEQ_LODIV_SYNC_SPARE_EN (TX) */
#define XCVR_TSM_TIMING61_SEQ_LODIV_SYNC_SPARE_EN_TX_HI(x) (((uint32_t)(((uint32_t)(x)) << XCVR_TSM_TIMING61_SEQ_LODIV_SYNC_SPARE_EN_TX_HI_SHIFT)) & XCVR_TSM_TIMING61_SEQ_LODIV_SYNC_SPARE_EN_TX_HI_MASK)

#define XCVR_TSM_TIMING61_SEQ_LODIV_SYNC_SPARE_EN_TX_LO_MASK (0xFF00U)
#define XCVR_TSM_TIMING61_SEQ_LODIV_SYNC_SPARE_EN_TX_LO_SHIFT (8U)
/*! SEQ_LODIV_SYNC_SPARE_EN_TX_LO - De-assertion time setting for SEQ_LODIV_SYNC_SPARE_EN (TX) */
#define XCVR_TSM_TIMING61_SEQ_LODIV_SYNC_SPARE_EN_TX_LO(x) (((uint32_t)(((uint32_t)(x)) << XCVR_TSM_TIMING61_SEQ_LODIV_SYNC_SPARE_EN_TX_LO_SHIFT)) & XCVR_TSM_TIMING61_SEQ_LODIV_SYNC_SPARE_EN_TX_LO_MASK)

#define XCVR_TSM_TIMING61_SEQ_LODIV_SYNC_SPARE_EN_RX_HI_MASK (0xFF0000U)
#define XCVR_TSM_TIMING61_SEQ_LODIV_SYNC_SPARE_EN_RX_HI_SHIFT (16U)
/*! SEQ_LODIV_SYNC_SPARE_EN_RX_HI - Assertion time setting for SEQ_LODIV_SYNC_SPARE_EN (RX) */
#define XCVR_TSM_TIMING61_SEQ_LODIV_SYNC_SPARE_EN_RX_HI(x) (((uint32_t)(((uint32_t)(x)) << XCVR_TSM_TIMING61_SEQ_LODIV_SYNC_SPARE_EN_RX_HI_SHIFT)) & XCVR_TSM_TIMING61_SEQ_LODIV_SYNC_SPARE_EN_RX_HI_MASK)

#define XCVR_TSM_TIMING61_SEQ_LODIV_SYNC_SPARE_EN_RX_LO_MASK (0xFF000000U)
#define XCVR_TSM_TIMING61_SEQ_LODIV_SYNC_SPARE_EN_RX_LO_SHIFT (24U)
/*! SEQ_LODIV_SYNC_SPARE_EN_RX_LO - De-assertion time setting for SEQ_LODIV_SYNC_SPARE_EN (RX) */
#define XCVR_TSM_TIMING61_SEQ_LODIV_SYNC_SPARE_EN_RX_LO(x) (((uint32_t)(((uint32_t)(x)) << XCVR_TSM_TIMING61_SEQ_LODIV_SYNC_SPARE_EN_RX_LO_SHIFT)) & XCVR_TSM_TIMING61_SEQ_LODIV_SYNC_SPARE_EN_RX_LO_MASK)
/*! @} */

/*! @name OVRD0 - TSM OVERRIDE REGISTER 0 */
/*! @{ */

#define XCVR_TSM_OVRD0_TSM_RF_ACTIVE_OVRD_EN_MASK (0x1U)
#define XCVR_TSM_OVRD0_TSM_RF_ACTIVE_OVRD_EN_SHIFT (0U)
/*! TSM_RF_ACTIVE_OVRD_EN - Override control for TSM_RF_ACTIVE
 *  0b0..Normal operation.
 *  0b1..Use the state of TSM_RF_ACTIVE_OVRD to override the signal "tsm_rf_active".
 */
#define XCVR_TSM_OVRD0_TSM_RF_ACTIVE_OVRD_EN(x)  (((uint32_t)(((uint32_t)(x)) << XCVR_TSM_OVRD0_TSM_RF_ACTIVE_OVRD_EN_SHIFT)) & XCVR_TSM_OVRD0_TSM_RF_ACTIVE_OVRD_EN_MASK)

#define XCVR_TSM_OVRD0_TSM_RF_ACTIVE_OVRD_MASK   (0x2U)
#define XCVR_TSM_OVRD0_TSM_RF_ACTIVE_OVRD_SHIFT  (1U)
/*! TSM_RF_ACTIVE_OVRD - Override value for TSM_RF_ACTIVE */
#define XCVR_TSM_OVRD0_TSM_RF_ACTIVE_OVRD(x)     (((uint32_t)(((uint32_t)(x)) << XCVR_TSM_OVRD0_TSM_RF_ACTIVE_OVRD_SHIFT)) & XCVR_TSM_OVRD0_TSM_RF_ACTIVE_OVRD_MASK)

