zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXW/periph5/PERI_XCVR_TSM.h
#define XCVR_TSM_OVRD3_SEQ_SPARE1_OVRD_MASK      (0x800000U)
#define XCVR_TSM_OVRD3_SEQ_SPARE1_OVRD_SHIFT     (23U)
/*! SEQ_SPARE1_OVRD - Override value for SEQ_SPARE1 */
#define XCVR_TSM_OVRD3_SEQ_SPARE1_OVRD(x)        (((uint32_t)(((uint32_t)(x)) << XCVR_TSM_OVRD3_SEQ_SPARE1_OVRD_SHIFT)) & XCVR_TSM_OVRD3_SEQ_SPARE1_OVRD_MASK)

#define XCVR_TSM_OVRD3_SEQ_SPARE3_OVRD_EN_MASK   (0x1000000U)
#define XCVR_TSM_OVRD3_SEQ_SPARE3_OVRD_EN_SHIFT  (24U)
/*! SEQ_SPARE3_OVRD_EN - Override control for SEQ_SPARE3
 *  0b0..Normal operation.
 *  0b1..Use the state of SEQ_SPARE3_OVRD to override the signal "seq_spare3".
 */
#define XCVR_TSM_OVRD3_SEQ_SPARE3_OVRD_EN(x)     (((uint32_t)(((uint32_t)(x)) << XCVR_TSM_OVRD3_SEQ_SPARE3_OVRD_EN_SHIFT)) & XCVR_TSM_OVRD3_SEQ_SPARE3_OVRD_EN_MASK)

#define XCVR_TSM_OVRD3_SEQ_SPARE3_OVRD_MASK      (0x2000000U)
#define XCVR_TSM_OVRD3_SEQ_SPARE3_OVRD_SHIFT     (25U)
/*! SEQ_SPARE3_OVRD - Override value for SEQ_SPARE3 */
#define XCVR_TSM_OVRD3_SEQ_SPARE3_OVRD(x)        (((uint32_t)(((uint32_t)(x)) << XCVR_TSM_OVRD3_SEQ_SPARE3_OVRD_SHIFT)) & XCVR_TSM_OVRD3_SEQ_SPARE3_OVRD_MASK)

#define XCVR_TSM_OVRD3_TX_MODE_OVRD_EN_MASK      (0x4000000U)
#define XCVR_TSM_OVRD3_TX_MODE_OVRD_EN_SHIFT     (26U)
/*! TX_MODE_OVRD_EN - Override control for TX_MODE
 *  0b0..Normal operation.
 *  0b1..Use the state of TX_MODE_OVRD to override the signal "tx_mode".
 */
#define XCVR_TSM_OVRD3_TX_MODE_OVRD_EN(x)        (((uint32_t)(((uint32_t)(x)) << XCVR_TSM_OVRD3_TX_MODE_OVRD_EN_SHIFT)) & XCVR_TSM_OVRD3_TX_MODE_OVRD_EN_MASK)

#define XCVR_TSM_OVRD3_TX_MODE_OVRD_MASK         (0x8000000U)
#define XCVR_TSM_OVRD3_TX_MODE_OVRD_SHIFT        (27U)
/*! TX_MODE_OVRD - Override value for TX_MODE */
#define XCVR_TSM_OVRD3_TX_MODE_OVRD(x)           (((uint32_t)(((uint32_t)(x)) << XCVR_TSM_OVRD3_TX_MODE_OVRD_SHIFT)) & XCVR_TSM_OVRD3_TX_MODE_OVRD_MASK)

#define XCVR_TSM_OVRD3_RX_MODE_OVRD_EN_MASK      (0x10000000U)
#define XCVR_TSM_OVRD3_RX_MODE_OVRD_EN_SHIFT     (28U)
/*! RX_MODE_OVRD_EN - Override control for RX_MODE
 *  0b0..Normal operation.
 *  0b1..Use the state of RX_MODE_OVRD to override the signal "rx_mode".
 */
#define XCVR_TSM_OVRD3_RX_MODE_OVRD_EN(x)        (((uint32_t)(((uint32_t)(x)) << XCVR_TSM_OVRD3_RX_MODE_OVRD_EN_SHIFT)) & XCVR_TSM_OVRD3_RX_MODE_OVRD_EN_MASK)

#define XCVR_TSM_OVRD3_RX_MODE_OVRD_MASK         (0x20000000U)
#define XCVR_TSM_OVRD3_RX_MODE_OVRD_SHIFT        (29U)
/*! RX_MODE_OVRD - Override value for RX_MODE */
#define XCVR_TSM_OVRD3_RX_MODE_OVRD(x)           (((uint32_t)(((uint32_t)(x)) << XCVR_TSM_OVRD3_RX_MODE_OVRD_SHIFT)) & XCVR_TSM_OVRD3_RX_MODE_OVRD_MASK)

#define XCVR_TSM_OVRD3_GEAR_SHIFT_OVRD_EN_MASK   (0x40000000U)
#define XCVR_TSM_OVRD3_GEAR_SHIFT_OVRD_EN_SHIFT  (30U)
/*! GEAR_SHIFT_OVRD_EN - Override control for GEAR_SHIFT
 *  0b0..Normal operation.
 *  0b1..Use the state of GEAR_SHIFT_OVRD to override the signal "gear_shift".
 */
#define XCVR_TSM_OVRD3_GEAR_SHIFT_OVRD_EN(x)     (((uint32_t)(((uint32_t)(x)) << XCVR_TSM_OVRD3_GEAR_SHIFT_OVRD_EN_SHIFT)) & XCVR_TSM_OVRD3_GEAR_SHIFT_OVRD_EN_MASK)

#define XCVR_TSM_OVRD3_GEAR_SHIFT_OVRD_MASK      (0x80000000U)
#define XCVR_TSM_OVRD3_GEAR_SHIFT_OVRD_SHIFT     (31U)
/*! GEAR_SHIFT_OVRD - Override value for GEAR_SHIFT */
#define XCVR_TSM_OVRD3_GEAR_SHIFT_OVRD(x)        (((uint32_t)(((uint32_t)(x)) << XCVR_TSM_OVRD3_GEAR_SHIFT_OVRD_SHIFT)) & XCVR_TSM_OVRD3_GEAR_SHIFT_OVRD_MASK)
/*! @} */

/*! @name OVRD4 - TSM OVERRIDE REGISTER 4 */
/*! @{ */

#define XCVR_TSM_OVRD4_SEQ_PIC_CORE_EN_OVRD_EN_MASK (0x1U)
#define XCVR_TSM_OVRD4_SEQ_PIC_CORE_EN_OVRD_EN_SHIFT (0U)
/*! SEQ_PIC_CORE_EN_OVRD_EN - Override control for SEQ_PIC_CORE_EN
 *  0b0..Normal operation.
 *  0b1..Use the state of SEQ_PIC_CORE_EN_OVRD to override the signal "seq_pic_core_en".
 */
#define XCVR_TSM_OVRD4_SEQ_PIC_CORE_EN_OVRD_EN(x) (((uint32_t)(((uint32_t)(x)) << XCVR_TSM_OVRD4_SEQ_PIC_CORE_EN_OVRD_EN_SHIFT)) & XCVR_TSM_OVRD4_SEQ_PIC_CORE_EN_OVRD_EN_MASK)

#define XCVR_TSM_OVRD4_SEQ_PIC_CORE_EN_OVRD_MASK (0x2U)
#define XCVR_TSM_OVRD4_SEQ_PIC_CORE_EN_OVRD_SHIFT (1U)
/*! SEQ_PIC_CORE_EN_OVRD - Override value for SEQ_PIC_CORE_EN */
#define XCVR_TSM_OVRD4_SEQ_PIC_CORE_EN_OVRD(x)   (((uint32_t)(((uint32_t)(x)) << XCVR_TSM_OVRD4_SEQ_PIC_CORE_EN_OVRD_SHIFT)) & XCVR_TSM_OVRD4_SEQ_PIC_CORE_EN_OVRD_MASK)

#define XCVR_TSM_OVRD4_SEQ_PIC_SHORT_CINT_SHORT_EN_OVRD_EN_MASK (0x4U)
#define XCVR_TSM_OVRD4_SEQ_PIC_SHORT_CINT_SHORT_EN_OVRD_EN_SHIFT (2U)
/*! SEQ_PIC_SHORT_CINT_SHORT_EN_OVRD_EN - Override control for SEQ_PIC_SHORT_CINT_SHORT_EN
 *  0b0..Normal operation.
 *  0b1..Use the state of SEQ_PIC_SHORT_CINT_SHORT_EN_OVRD to override the signal "seq_pic_short_cint_short_en".
 */
#define XCVR_TSM_OVRD4_SEQ_PIC_SHORT_CINT_SHORT_EN_OVRD_EN(x) (((uint32_t)(((uint32_t)(x)) << XCVR_TSM_OVRD4_SEQ_PIC_SHORT_CINT_SHORT_EN_OVRD_EN_SHIFT)) & XCVR_TSM_OVRD4_SEQ_PIC_SHORT_CINT_SHORT_EN_OVRD_EN_MASK)

#define XCVR_TSM_OVRD4_SEQ_PIC_SHORT_CINT_SHORT_EN_OVRD_MASK (0x8U)
#define XCVR_TSM_OVRD4_SEQ_PIC_SHORT_CINT_SHORT_EN_OVRD_SHIFT (3U)
/*! SEQ_PIC_SHORT_CINT_SHORT_EN_OVRD - Override value for SEQ_PIC_SHORT_CINT_SHORT_EN */
#define XCVR_TSM_OVRD4_SEQ_PIC_SHORT_CINT_SHORT_EN_OVRD(x) (((uint32_t)(((uint32_t)(x)) << XCVR_TSM_OVRD4_SEQ_PIC_SHORT_CINT_SHORT_EN_OVRD_SHIFT)) & XCVR_TSM_OVRD4_SEQ_PIC_SHORT_CINT_SHORT_EN_OVRD_MASK)

#define XCVR_TSM_OVRD4_SEQ_PIC_FILTER_LOW_BW_SM_EN_OVRD_EN_MASK (0x10U)
#define XCVR_TSM_OVRD4_SEQ_PIC_FILTER_LOW_BW_SM_EN_OVRD_EN_SHIFT (4U)
/*! SEQ_PIC_FILTER_LOW_BW_SM_EN_OVRD_EN - Override control for SEQ_PIC_FILTER_LOW_BW_SM_EN
 *  0b0..Normal operation.
 *  0b1..Use the state of SEQ_PIC_FILTER_LOW_BW_SM_EN_OVRD to override the signal "seq_pic_filter_low_bw_sm_en".
 */
#define XCVR_TSM_OVRD4_SEQ_PIC_FILTER_LOW_BW_SM_EN_OVRD_EN(x) (((uint32_t)(((uint32_t)(x)) << XCVR_TSM_OVRD4_SEQ_PIC_FILTER_LOW_BW_SM_EN_OVRD_EN_SHIFT)) & XCVR_TSM_OVRD4_SEQ_PIC_FILTER_LOW_BW_SM_EN_OVRD_EN_MASK)

#define XCVR_TSM_OVRD4_SEQ_PIC_FILTER_LOW_BW_SM_EN_OVRD_MASK (0x20U)
#define XCVR_TSM_OVRD4_SEQ_PIC_FILTER_LOW_BW_SM_EN_OVRD_SHIFT (5U)
/*! SEQ_PIC_FILTER_LOW_BW_SM_EN_OVRD - Override value for SEQ_PIC_FILTER_LOW_BW_SM_EN */
#define XCVR_TSM_OVRD4_SEQ_PIC_FILTER_LOW_BW_SM_EN_OVRD(x) (((uint32_t)(((uint32_t)(x)) << XCVR_TSM_OVRD4_SEQ_PIC_FILTER_LOW_BW_SM_EN_OVRD_SHIFT)) & XCVR_TSM_OVRD4_SEQ_PIC_FILTER_LOW_BW_SM_EN_OVRD_MASK)

#define XCVR_TSM_OVRD4_SEQ_PIC_RFB_OPEN_SM_EN_OVRD_EN_MASK (0x40U)
#define XCVR_TSM_OVRD4_SEQ_PIC_RFB_OPEN_SM_EN_OVRD_EN_SHIFT (6U)
/*! SEQ_PIC_RFB_OPEN_SM_EN_OVRD_EN - Override control for SEQ_PIC_RFB_OPEN_SM_EN
 *  0b0..Normal operation.
 *  0b1..Use the state of SEQ_PIC_RFB_OPEN_SM_EN_OVRD to override the signal "seq_pic_rfb_open_sm_en".
 */
#define XCVR_TSM_OVRD4_SEQ_PIC_RFB_OPEN_SM_EN_OVRD_EN(x) (((uint32_t)(((uint32_t)(x)) << XCVR_TSM_OVRD4_SEQ_PIC_RFB_OPEN_SM_EN_OVRD_EN_SHIFT)) & XCVR_TSM_OVRD4_SEQ_PIC_RFB_OPEN_SM_EN_OVRD_EN_MASK)

