zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXW/periph5/PERI_XCVR_TSM.h
#define XCVR_TSM_OVRD4_SEQ_PIC_RFB_OPEN_SM_EN_OVRD_MASK (0x80U)
#define XCVR_TSM_OVRD4_SEQ_PIC_RFB_OPEN_SM_EN_OVRD_SHIFT (7U)
/*! SEQ_PIC_RFB_OPEN_SM_EN_OVRD - Override value for SEQ_PIC_RFB_OPEN_SM_EN */
#define XCVR_TSM_OVRD4_SEQ_PIC_RFB_OPEN_SM_EN_OVRD(x) (((uint32_t)(((uint32_t)(x)) << XCVR_TSM_OVRD4_SEQ_PIC_RFB_OPEN_SM_EN_OVRD_SHIFT)) & XCVR_TSM_OVRD4_SEQ_PIC_RFB_OPEN_SM_EN_OVRD_MASK)

#define XCVR_TSM_OVRD4_SEQ_PIC_RINT2_SHORT_FM_EN_OVRD_EN_MASK (0x100U)
#define XCVR_TSM_OVRD4_SEQ_PIC_RINT2_SHORT_FM_EN_OVRD_EN_SHIFT (8U)
/*! SEQ_PIC_RINT2_SHORT_FM_EN_OVRD_EN - Override control for SEQ_PIC_RINT2_SHORT_FM_EN
 *  0b0..Normal operation.
 *  0b1..Use the state of SEQ_PIC_RINT2_SHORT_FM_EN_OVRD to override the signal "seq_pic_rint2_short_fm_en".
 */
#define XCVR_TSM_OVRD4_SEQ_PIC_RINT2_SHORT_FM_EN_OVRD_EN(x) (((uint32_t)(((uint32_t)(x)) << XCVR_TSM_OVRD4_SEQ_PIC_RINT2_SHORT_FM_EN_OVRD_EN_SHIFT)) & XCVR_TSM_OVRD4_SEQ_PIC_RINT2_SHORT_FM_EN_OVRD_EN_MASK)

#define XCVR_TSM_OVRD4_SEQ_PIC_RINT2_SHORT_FM_EN_OVRD_MASK (0x200U)
#define XCVR_TSM_OVRD4_SEQ_PIC_RINT2_SHORT_FM_EN_OVRD_SHIFT (9U)
/*! SEQ_PIC_RINT2_SHORT_FM_EN_OVRD - Override value for SEQ_PIC_RINT2_SHORT_FM_EN */
#define XCVR_TSM_OVRD4_SEQ_PIC_RINT2_SHORT_FM_EN_OVRD(x) (((uint32_t)(((uint32_t)(x)) << XCVR_TSM_OVRD4_SEQ_PIC_RINT2_SHORT_FM_EN_OVRD_SHIFT)) & XCVR_TSM_OVRD4_SEQ_PIC_RINT2_SHORT_FM_EN_OVRD_MASK)

#define XCVR_TSM_OVRD4_SEQ_LODIV_SYNC_RESET_EN_OVRD_EN_MASK (0x400U)
#define XCVR_TSM_OVRD4_SEQ_LODIV_SYNC_RESET_EN_OVRD_EN_SHIFT (10U)
/*! SEQ_LODIV_SYNC_RESET_EN_OVRD_EN - Override control for SEQ_LODIV_SYNC_RESET_EN
 *  0b0..Normal operation.
 *  0b1..Use the state of SEQ_LODIV_SYNC_RESET_EN_OVRD to override the signal "seq_lodiv_sync_reset_en".
 */
#define XCVR_TSM_OVRD4_SEQ_LODIV_SYNC_RESET_EN_OVRD_EN(x) (((uint32_t)(((uint32_t)(x)) << XCVR_TSM_OVRD4_SEQ_LODIV_SYNC_RESET_EN_OVRD_EN_SHIFT)) & XCVR_TSM_OVRD4_SEQ_LODIV_SYNC_RESET_EN_OVRD_EN_MASK)

#define XCVR_TSM_OVRD4_SEQ_LODIV_SYNC_RESET_EN_OVRD_MASK (0x800U)
#define XCVR_TSM_OVRD4_SEQ_LODIV_SYNC_RESET_EN_OVRD_SHIFT (11U)
/*! SEQ_LODIV_SYNC_RESET_EN_OVRD - Override value for SEQ_LODIV_SYNC_RESET_EN */
#define XCVR_TSM_OVRD4_SEQ_LODIV_SYNC_RESET_EN_OVRD(x) (((uint32_t)(((uint32_t)(x)) << XCVR_TSM_OVRD4_SEQ_LODIV_SYNC_RESET_EN_OVRD_SHIFT)) & XCVR_TSM_OVRD4_SEQ_LODIV_SYNC_RESET_EN_OVRD_MASK)

#define XCVR_TSM_OVRD4_SEQ_LODIV_SYNC_EN_OVRD_EN_MASK (0x1000U)
#define XCVR_TSM_OVRD4_SEQ_LODIV_SYNC_EN_OVRD_EN_SHIFT (12U)
/*! SEQ_LODIV_SYNC_EN_OVRD_EN - Override control for SEQ_LODIV_SYNC_EN
 *  0b0..Normal operation.
 *  0b1..Use the state of SEQ_LODIV_SYNC_EN_OVRD to override the signal "seq_lodiv_sync_en".
 */
#define XCVR_TSM_OVRD4_SEQ_LODIV_SYNC_EN_OVRD_EN(x) (((uint32_t)(((uint32_t)(x)) << XCVR_TSM_OVRD4_SEQ_LODIV_SYNC_EN_OVRD_EN_SHIFT)) & XCVR_TSM_OVRD4_SEQ_LODIV_SYNC_EN_OVRD_EN_MASK)

#define XCVR_TSM_OVRD4_SEQ_LODIV_SYNC_EN_OVRD_MASK (0x2000U)
#define XCVR_TSM_OVRD4_SEQ_LODIV_SYNC_EN_OVRD_SHIFT (13U)
/*! SEQ_LODIV_SYNC_EN_OVRD - Override value for SEQ_LODIV_SYNC_EN */
#define XCVR_TSM_OVRD4_SEQ_LODIV_SYNC_EN_OVRD(x) (((uint32_t)(((uint32_t)(x)) << XCVR_TSM_OVRD4_SEQ_LODIV_SYNC_EN_OVRD_SHIFT)) & XCVR_TSM_OVRD4_SEQ_LODIV_SYNC_EN_OVRD_MASK)

#define XCVR_TSM_OVRD4_SEQ_LODIV_SYNC_SPARE_EN_OVRD_EN_MASK (0x4000U)
#define XCVR_TSM_OVRD4_SEQ_LODIV_SYNC_SPARE_EN_OVRD_EN_SHIFT (14U)
/*! SEQ_LODIV_SYNC_SPARE_EN_OVRD_EN - Override control for SEQ_LODIV_SYNC_SPARE_EN
 *  0b0..Normal operation.
 *  0b1..Use the state of SEQ_LODIV_SYNC_SPARE_EN_OVRD to override the signal "seq_lodiv_sync_spare_en".
 */
#define XCVR_TSM_OVRD4_SEQ_LODIV_SYNC_SPARE_EN_OVRD_EN(x) (((uint32_t)(((uint32_t)(x)) << XCVR_TSM_OVRD4_SEQ_LODIV_SYNC_SPARE_EN_OVRD_EN_SHIFT)) & XCVR_TSM_OVRD4_SEQ_LODIV_SYNC_SPARE_EN_OVRD_EN_MASK)

#define XCVR_TSM_OVRD4_SEQ_LODIV_SYNC_SPARE_EN_OVRD_MASK (0x8000U)
#define XCVR_TSM_OVRD4_SEQ_LODIV_SYNC_SPARE_EN_OVRD_SHIFT (15U)
/*! SEQ_LODIV_SYNC_SPARE_EN_OVRD - Override value for SEQ_LODIV_SYNC_SPARE_EN */
#define XCVR_TSM_OVRD4_SEQ_LODIV_SYNC_SPARE_EN_OVRD(x) (((uint32_t)(((uint32_t)(x)) << XCVR_TSM_OVRD4_SEQ_LODIV_SYNC_SPARE_EN_OVRD_SHIFT)) & XCVR_TSM_OVRD4_SEQ_LODIV_SYNC_SPARE_EN_OVRD_MASK)
/*! @} */

/*! @name CTRL2 - TSM CONTROL 2 */
/*! @{ */

#define XCVR_TSM_CTRL2_RST_CSR_SW_EN_MASK        (0x1U)
#define XCVR_TSM_CTRL2_RST_CSR_SW_EN_SHIFT       (0U)
/*! RST_CSR_SW_EN - Reset CSR Timing Values By SW 1
 *  0b0..Reset Enabled
 *  0b1..Reset Disabled
 */
#define XCVR_TSM_CTRL2_RST_CSR_SW_EN(x)          (((uint32_t)(((uint32_t)(x)) << XCVR_TSM_CTRL2_RST_CSR_SW_EN_SHIFT)) & XCVR_TSM_CTRL2_RST_CSR_SW_EN_MASK)

#define XCVR_TSM_CTRL2_RST_CSR_SW2_EN_MASK       (0x2U)
#define XCVR_TSM_CTRL2_RST_CSR_SW2_EN_SHIFT      (1U)
/*! RST_CSR_SW2_EN - Reset CSR Timing Values By SW 2
 *  0b0..Reset Enabled
 *  0b1..Reset Disabled
 */
#define XCVR_TSM_CTRL2_RST_CSR_SW2_EN(x)         (((uint32_t)(((uint32_t)(x)) << XCVR_TSM_CTRL2_RST_CSR_SW2_EN_SHIFT)) & XCVR_TSM_CTRL2_RST_CSR_SW2_EN_MASK)
/*! @} */


/*!
 * @}
 */ /* end of group XCVR_TSM_Register_Masks */


/*!
 * @}
 */ /* end of group XCVR_TSM_Peripheral_Access_Layer */


/*
** End of section using anonymous unions
*/

#if defined(__ARMCC_VERSION)
  #if (__ARMCC_VERSION >= 6010050)
    #pragma clang diagnostic pop
  #else
    #pragma pop
  #endif
#elif defined(__GNUC__)
  /* leave anonymous unions enabled */
#elif defined(__IAR_SYSTEMS_ICC__)
  #pragma language=default
#else
  #error Not supported compiler type
#endif

/*!
 * @}
 */ /* end of group Peripheral_access_layer */


#endif  /* PERI_XCVR_TSM_H_ */

